Магазин_Гаджетонов/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Магазин_Гаджетонов/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если (ТекПользователь = Неопределено) Тогда	
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;				
	КонецЕсли;

	ТекПользователь.Роли.Очистить();

	Для Каждого СтрокаРоли Из ТаблицаПрав Цикл
		
		Если СтрокаРоли.Включена Тогда		
			Роль = Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли);
			ТекПользователь.Роли.Добавить(Роль);
		КонецЕсли;
		
	КонецЦикла;
			
	ТекПользователь.Записать();
	
КонецПроцедуры
